# Pandas Assignment 3

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('kc_house_data.csv')

## Part 1

The numerical variables which can be considered categorical are the variables that have int or float type for example, but are not indicative in terms of quantity and it is rather representing a category. In addition to that, applying arithmetic functions on these variable are not relevant

We will elaborate more by taking the houses dataFrame and showing examples of these type of variables

In [3]:
df[['id','bedrooms','bathrooms','grade','condition']].head() # examples of categorical values

           id  bedrooms  bathrooms  grade  condition
0  7129300520         3       1.00      7          3
1  6414100192         3       2.25      7          3
2  5631500400         2       1.00      6          3
3  2487200875         4       3.00      7          5
4  1954400510         3       2.00      8          3

- The grade variable is considered a categorical value since each grade value represent a catogery of the construction quality. It does not represent any quantity although it is an integer.
- The bathrooms column contains float variables but it does not represent the number of bathrooms since it is not relevant to have 0.25 or 0.5 bathroom. It does not indicate anything in terms of quantity. However these values represent bathroom categories. For example a bathroom of 0.25 can refer to a toilet and a sink only. So it is one bathroom category 
- The bedrooms in this case as well represent a category. It is not literraly refering to the quantity of bedrooms as much as to refer to house categories. Ex: houses with 5 bedrooms is considered a different category than houses with 3 bedrooms

## Part 2

In this part, we will work with missing values. We will start by adding missing values to a subset we will create. Than use different methods to fill in:

In [4]:
list_columns = ['price', 'bedrooms', 'sqft_living', 'grade'] 
df1 = df[list_columns].copy()

In [5]:
df1.shape #Check the initial number of rows

(21613, 4)

In [6]:
import numpy as np
missing_percentage = 0.05  # 5% missing values

In [7]:
mask = np.random.rand(*df1.shape) < missing_percentage
df1[mask] = np.nan

Now we will check if the missing values are inserted

In [8]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21613 entries, 0 to 21612
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   price        20527 non-null  float64
 1   bedrooms     20535 non-null  float64
 2   sqft_living  20566 non-null  float64
 3   grade        20528 non-null  float64
dtypes: float64(4)
memory usage: 675.5 KB

We will try another value of percentage:

In [9]:
missing_percentage = 0.15 #15% of missing values

In [10]:
mask = np.random.rand(*df1.shape) < missing_percentage
df1[mask] = np.nan

In [11]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21613 entries, 0 to 21612
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   price        17446 non-null  float64
 1   bedrooms     17587 non-null  float64
 2   sqft_living  17538 non-null  float64
 3   grade        17504 non-null  float64
dtypes: float64(4)
memory usage: 675.5 KB

In [12]:
df1.head(10)

       price  bedrooms  sqft_living  grade
0   221900.0       3.0       1180.0    7.0
1   538000.0       NaN       2570.0    7.0
2   180000.0       2.0        770.0    NaN
3        NaN       4.0          NaN    7.0
4   510000.0       3.0       1680.0    8.0
5  1230000.0       4.0       5420.0   11.0
6   257500.0       3.0       1715.0    7.0
7   291850.0       NaN       1060.0    7.0
8   229500.0       3.0       1780.0    7.0
9   323000.0       3.0       1890.0    7.0

Clearly now we can see the missing values

Method 1: We will clean the missing values by deletion applying the drop na function only for the grade and price column

In [13]:
df_cleaned=df1.dropna(subset=['grade', 'price'])

In [14]:
df_cleaned.info()

<class 'pandas.core.frame.DataFrame'>
Index: 14160 entries, 0 to 21611
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   price        14160 non-null  float64
 1   bedrooms     11492 non-null  float64
 2   sqft_living  11479 non-null  float64
 3   grade        14160 non-null  float64
dtypes: float64(4)
memory usage: 553.1 KB

No missing for price and grade values after deletion

In [15]:
df_cleaned

           price  bedrooms  sqft_living  grade
0       221900.0       3.0       1180.0    7.0
1       538000.0       NaN       2570.0    7.0
4       510000.0       3.0       1680.0    8.0
5      1230000.0       4.0       5420.0   11.0
6       257500.0       3.0       1715.0    7.0
...          ...       ...          ...    ...
21606  1010000.0       4.0          NaN    9.0
21608   360000.0       3.0       1530.0    8.0
21609   400000.0       4.0       2310.0    8.0
21610   402101.0       NaN       1020.0    7.0
21611   400000.0       3.0       1600.0    8.0

[14160 rows x 4 columns]

Methode 2: We will clean the missing values by filling the cells with the mean of each column

In [16]:
df_filled_with_mean = df1.fillna(df1.mean())

In [17]:
df_filled_with_mean.head(20)

           price  bedrooms  sqft_living      grade
0   2.219000e+05  3.000000  1180.000000   7.000000
1   5.380000e+05  3.368056  2570.000000   7.000000
2   1.800000e+05  2.000000   770.000000   7.652765
3   5.404028e+05  4.000000  2082.661079   7.000000
4   5.100000e+05  3.000000  1680.000000   8.000000
5   1.230000e+06  4.000000  5420.000000  11.000000
6   2.575000e+05  3.000000  1715.000000   7.000000
7   2.918500e+05  3.368056  1060.000000   7.000000
8   2.295000e+05  3.000000  1780.000000   7.000000
9   3.230000e+05  3.000000  1890.000000   7.000000
10  5.404028e+05  3.000000  3560.000000   8.000000
11  4.680000e+05  2.000000  1160.000000   7.000000
12  3.100000e+05  3.368056  1430.000000   7.000000
13  4.000000e+05  3.000000  2082.661079   7.000000
14  5.404028e+05  5.000000  1810.000000   7.000000
15  6.500000e+05  4.000000  2950.000000   7.652765
16  3.950000e+05  3.000000  1890.000000   7.000000
17  4.850000e+05  4.000000  2082.661079   7.652765
18  1.890000e+05  3.368056  2082.661079   7.000000
19  2.300000e+05  3.000000  2082.661079   7.000000

Finally since there are some numerical values that are categorical, the mean function is not appropriate to apply. So we will treat each column differently. For the price and sqft we will fill with the mean values. However for the rest we will fill with the mode value.

In [18]:
df_filled_with_mean2 = df1

In [19]:
df_filled_with_mean2['price']=df1['price'].fillna(df1['price'].mean())
df_filled_with_mean2['sqft_living']=df1['sqft_living'].fillna(df1['sqft_living'].mean())
df_filled_with_mean2['grade']=df1['grade'].fillna(df1['grade'].mode().iloc[0])
df_filled_with_mean2['bedrooms']=df1['bedrooms'].fillna(df1['bedrooms'].mode().iloc[0])

In [20]:
df_filled_with_mean2

               price  bedrooms  sqft_living  grade
0      221900.000000       3.0  1180.000000    7.0
1      538000.000000       3.0  2570.000000    7.0
2      180000.000000       2.0   770.000000    7.0
3      540402.803508       4.0  2082.661079    7.0
4      510000.000000       3.0  1680.000000    8.0
...              ...       ...          ...    ...
21608  360000.000000       3.0  1530.000000    8.0
21609  400000.000000       4.0  2310.000000    8.0
21610  402101.000000       3.0  1020.000000    7.0
21611  400000.000000       3.0  1600.000000    8.0
21612  540402.803508       2.0  1020.000000    7.0

[21613 rows x 4 columns]